Revit 2024 API
ImageExportOptions.PixelSize Property
 The pixel size of an image in one direction. Used only if ZoomType is FitToPage.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public int PixelSize { get; set; }
Visual Basic
Public Property PixelSize As Integer
	Get
	Set
Visual C++
public:
property int PixelSize {
	int get ();
	void set (int value);
}
Remarks
 The default is 512 pixels.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The PixelSize value is outside the permitted range.
See Also
ImageExportOptions Class
Autodesk.Revit.DB Namespace